#pragma once
#include "Numberic.h"
#include "Error.h"

namespace Area2D 
{
	// Абстрактний клас представляє сектор овальних фігур.
	// Містить методи для переведення радіан у градуса та навпаки.

	// Абстрактний базовий клас для всіх секторів 2D геометричних 
	// овальних фігур.
	// Містить віртуальні методи для обчислення периметру, площі 
	// та відображення координат фігури.
	class Sector 
	{
	protected:
		double radian;
		int degree;

	public:
		// Базовий конструктор.
		Sector();

		// Конструктор, що приймає радіану як градусну міру.
		Sector(double radian);

		// Конструктор, що приймає градус як градусну міру.
		Sector(int degree);

		// Повертає кут.
		double getAngle() const;
	};
}